cf/InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/НастройкиПользователей/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Перем ОбновлятьЗначениеГлПеременной;
	
	СвойствоОсновнаяОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация;
	
	Для Каждого Запись ИЗ ЭтотОбъект Цикл
		Если Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
			Если Запись.Настройка = СвойствоОсновнаяОрганизация Тогда
				глЗначениеПеременнойУстановить("ОсновнаяОрганизация", Запись.Значение, Истина);
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
		
	КэшНастроекПользователей = глЗначениеПеременной("ЗначенияНастроекПользователей");
	УправлениеПользователями.ИнформироватьОИзмененииНастроекПравАктивныхПользователей(ЭтотОбъект, 
																					  КэшНастроекПользователей, 
																					  "Настройка",
																					  глЗначениеПеременной("глТекущийПользователь"), 
																					  "значения настроек",
																					  ОбновлятьЗначениеГлПеременной);
																					  
	Если ОбновлятьЗначениеГлПеременной Тогда
		глЗначениеПеременнойУстановить("ЗначенияНастроекПользователей", КэшНастроекПользователей, Истина);
	КонецЕсли;	
	
КонецПроцедуры
